# coding=utf-8
"""
爬取百度图片的高清原图
"""
import re
import sys
import urllib
import os
 
import requests
 

def getPage(keyword,page,n):
    page=page*n
    keyword=urllib.parse.quote(keyword, safe='/')
    url_begin = "https://image.baidu.com/search/index?ct=201326592&z=2&tn=baiduimage&ipn=r&word="
    url = url_begin+keyword+'&pn='+str(page)+"&istype=2&ie=utf-8&oe=utf-8&cl=2&lm=-1&st=-1&fr=&fmq=&ic=0&se=&sme=&width=0&height=0&face=0"

    return url
 
def get_onepage_urls(onepageurl):
    try:
        html = requests.get(onepageurl).text
    except Exception as e:
        print(e)
        pic_urls = []
        return pic_urls
    pic_urls = re.findall('"hoverURL":"(.*?)",', html, re.S)
    return pic_urls
 
 
image_count = 0
def down_pic(pic_urls, localPath):
    if not os.path.exists(localPath):  # 新建文件夹
        os.mkdir(localPath)
    """给出图片链接列表, 下载所有图片"""
    global image_count
    for i, pic_url in enumerate(pic_urls):
        try:
            pic = requests.get(pic_url, timeout=15)
            string =str(i + 1) + '.jpg'
            with open(localPath + 'idc_{0:06d}.jpg'.format(image_count), 'wb') as f:
                f.write(pic.content)
                print('成功下载第%s张图片: %s' % (str(image_count + 1), str(pic_url)))
                image_count = image_count + 1
        except Exception as e:
            print('下载第%s张图片时失败: %s' % (str(image_count + 1), str(pic_url)))
            print(e)
            continue
 
 
if __name__ == '__main__':
    keyword_list = ['证件照+男', '证件照+女']
    # keyword_list = ['正脸 范冰冰', '正脸 赵丽颖', '正脸 郑爽', '正脸 唐嫣', '正脸 杨颖', '正脸 杨幂', '正脸 柳岩', '正脸 李小璐',
    #                 '正脸 古力娜扎', '正脸 金星', '正脸 刘亦菲', '正脸 刘诗诗', '正脸 霍思燕', '正脸 邓紫棋', '正脸 赵薇', '正脸 白洁',
    #                 '正脸 孙俪', '正脸 谢娜', '正脸 姚笛', '正脸 刘涛', '正脸 宋茜', '正脸 倪妮', '正脸 马丽', '正脸 蒋欣',
    #                 '正脸 高圆圆', '正脸 那英', '正脸 张靓颖', '正脸 王鸥', '正脸 娄艺潇', '正脸 徐静蕾', '正脸 王丽坤', '正脸 杨钰莹',
    #                 '正脸 冉莹颖', '正脸 刘雯', '正脸 白百何', '正脸 谭维维', '正脸 王菲', '正脸 戚薇', '正脸 许晴', '正脸 吴莫愁',
    #                 '正脸 李菲儿', '正脸 赵奕欢', '正脸 焦俊艳', '正脸 吴昕', '正脸 张子萱', '正脸 杨蓉', '正脸 周冬齐', '正脸 汤唯',
    #                 '正脸 刘敏涛', '正脸 林妙可', '正脸 董卿', '正脸 杜鹃', '正脸 彭丽媛', '正脸 姚星彤', '正脸 佟丽娅', '正脸 陈好',
    #                 '正脸 黄圣依', '正脸 熊黛林', '正脸 舒畅', '正脸 袁姗姗', '正脸 王晓晨', '正脸 马程程', '正脸 李冰冰', '正脸 干露露',
    #                 '正脸 章子怡', '正脸 景甜', '正脸 周迅', '正脸 宋祖英', '正脸 王乐君', '正脸 李佳', '正脸 杨紫', '正脸 李沁',
    #                 '正脸 李宇春', '正脸 李思思', '正脸 周韦彤', '正脸 马苏', '正脸 周奇奇', '正脸 王小丫', '正脸 甘婷婷', '正脸 吕一',
    #                 '正脸 刘晓庆', '正脸 徐娇', '正脸 蓝燕', '正脸 马思纯', '正脸 王珞丹', '正脸 江一燕', '正脸 徐璐', '正脸 海陆',
    #                 '正脸 关悦', '正脸 张歆艺', '正脸 陈紫函', '正脸 贾青', '正脸 韩雪', '正脸 刘萌萌', '正脸 曹颖', '正脸 李小冉',
    #                 '正脸 白冰', '正脸 颜丹晨', '正脸 马诺', '正脸 莫小棋', '正脸 姚晨', '正脸 张萌', '正脸 秦岚', '正脸 陈畅',
    #                 '正脸 秦海璐', '正脸 周冬雨', '正脸 杨丽萍', '正脸 韩红', '正脸 李纯', '正脸 关晓彤', '正脸 陈数', '正脸 王珂',
    #                 '正脸 张含韵', '正脸 朱迅', '正脸 孙莉', '正脸 刘璇', '正脸 张静初', '正脸 唐艺昕', '正脸 田华', '正脸 张子枫',
    #                 '正脸 马伊琍', '正脸 宋佳', '正脸 周涛', '正脸 刘芸', '正脸 董洁', '正脸 张雨绮', '正脸 毛晓彤', '正脸 朱丹',
    #                 '正脸 鲍蕾', '正脸 周秀娜', '正脸 董璇', '正脸 陈红', '正脸 何洁', '正脸 张雪迎', '正脸 蒋勤勤', '正脸 李娜',
    #                 '正脸 黄奕', '正脸 马雅舒', '正脸 江疏影', '正脸 海清', '正脸 车晓', '正脸 尚雯婕', '正脸 李玲玉', '正脸 谢楠',
    #                 '正脸 熊乃瑾', '正脸 叶蓓', '正脸 王艳', '正脸 蒋梦婕', '正脸 张蓝心', '正脸 邓家佳', '正脸 金莎', '正脸 杨乐乐',
    #                 '正脸 宋丹丹', '正脸 安又琪', '正脸 叶梓萱', '正脸 何晴', '正脸 袁泉', '正脸 张馨予', '正脸 何琳', '正脸 胡蝶',
    #                 '正脸 胡静', '正脸 刘雨欣', '正脸 陈洁', '正脸 毛阿敏', '正脸 林忆莲', '正脸 胡杨林', '正脸 甘露', '正脸 张凯丽',

    #                 '正脸 李易峰', '正脸 杨洋', '正脸 陈晓', '正脸 张磊', '正脸 鹿晗', '正脸 李晨', '正脸 刘烨', '正脸 张翰', '正脸 陈学冬',
    #                 '正脸 何炅', '正脸 陈赫', '正脸 马可', '正脸 吴磊', '正脸 罗晋', '正脸 张杰', '正脸 王凯', '正脸 陈翔', '正脸 靳东',
    #                 '正脸 邓超', '正脸 毕福剑', '正脸 胡歌', '正脸 张丹峰', '正脸 井柏然', '正脸 郑恺', '正脸 黄晓明', '正脸 吴京', '正脸 小沈阳',
    #                 '正脸 任重', '正脸 黄磊', '正脸 吴秀波', '正脸 张晋', '正脸 黄渤', '正脸 赵本山', '正脸 贾乃亮', '正脸 蒋劲夫', '正脸  佟大为',
    #                 '正脸 包贝尔', '正脸 郭德纲', '正脸 韩庚','正脸 林永健', '正脸 陆毅', '正脸 孙艺洲', '正脸 魏晨', '正脸 马天宇', '正脸 付辛博',
    #                 '正脸 车保罗', '正脸 黄家驹', '正脸 文章', '正脸 汪涵', '正脸 胡彦斌', '正脸 易建联', '正脸 汪东城', '正脸 胡军', '正脸 李健',
    #                 '正脸 李亚鹏', '正脸 郭涛', '正脸 王千源', '正脸 林更新', '正脸 薛之谦', '正脸 宋小宝','正脸 陈坤', '正脸 张嘉译', '正脸 周杰',
    #                 '正脸 岳云鹏', '正脸 朴树', '正脸 杜海涛', '正脸 杜淳', '正脸 郭敬明', '正脸 陈龙', '正脸 释小龙', '正脸 袁弘', '正脸 杜江',
    #                 '正脸 赵文卓', '正脸 高云翔','正脸 段奕宏', '正脸 刘奕君', '正脸 李琦', '正脸 张哲瀚', '正脸 金世佳', '正脸 撒贝宁', '正脸 冯绍峰',
    #                 '正脸 华山', '正脸 林峰', '正脸 任泉', '正脸 乔任梁', '正脸 徐峥', '正脸 徐锦江', '正脸 蔡国庆', '正脸 张睿', '正脸 常远',
    #                 '正脸 陈思成', '正脸 姚明', '正脸 高晓松', '正脸 李宁', '正脸 王迅', '正脸 陈道明','正脸 张丰毅', '正脸 乔振宇', '正脸 张子健',
    #                 '正脸 高鑫', '正脸 于荣光', '正脸 黄海波', '正脸 李佳航', '正脸 吴孟达', '正脸 周立波', '正脸 郑钧','正脸 王学兵', '正脸 曹云金',
    #                 '正脸 李玉刚', '正脸 陈百强', '正脸 朱亚文', '正脸 陆川', '正脸 叶祖新', '正脸 夏雨', '正脸 冯小刚', '正脸 李幼斌', '正脸 钱国伟',
    #                 '正脸 王雷', '正脸 杨坤', '正脸 田亮', '正脸 于正', '正脸 王岳伦', '正脸 李维嘉', '正脸 杨子', '正脸 张伦硕', '正脸 张一山',
    #                 '正脸 赵忠祥', '正脸 许冠杰', '正脸 郭京飞', '正脸 王晶', '正脸 潘粤明', '正脸 姜武', '正脸 潘石屹', '正脸 迟志强', '正脸 潘长江',
    #                 '正脸 秦昊','正脸 锦荣', '正脸 尤浩然', '正脸 吴宇森', '正脸 黄安', '正脸 唐国强', '正脸 乐嘉', '正脸 计春华', '正脸 张亮', '正脸 林依轮',
    #                 '正脸 李光洁', '正脸 于晓光', '正脸 罗马', '正脸 郭峰', '正脸 金山', '正脸 张国立', '正脸 张艺谋', '正脸 王宁', '正脸 费玉清', '正脸 罗永浩',
    #                 '正脸 李咏', '正脸 陈思诚', '正脸 田雨', '正脸 徐少华', '正脸 黄轩', '正脸 朱军', '正脸 赵英俊', '正脸 于和伟', '正脸 毛宁', '正脸 姜文',
    #                 '正脸 冯巩', '正脸 黄明', '正脸 王聪', '正脸 齐秦', '正脸 邓超', '正脸 王磊', '正脸 郭晓然', '正脸 刘欢', '正脸 王志文', '正脸 孔笙',
    #                 '正脸 沙宝亮','正脸 王小利', '正脸 黄国伦', '正脸 阎维文', '正脸 孔二狗', '正脸 吴迪', '正脸 刘翔', '正脸 陈楚生', '正脸 李响', '正脸 张鲁一',
    #                 '正脸 周传雄', '正脸 林志炫', '正脸 孙楠', '正脸 陈凯歌', '正脸 杨志刚', '正脸 李泉', '正脸 黄海冰', '正脸 高峰', '正脸 张国强', '正脸 吴耀汉',
    #                 '正脸 徐海乔', '正脸 刘滨', '正脸 郝云', '正脸 孟非', '正脸 崔健', '正脸 范伟', '正脸 马东', '正脸 谢天笑', '正脸 孙坚', '正脸 李敖']

    for keyword in keyword_list:
        #keyword = '个人证件照'  # 关键词, 改为你想输入的词即可, 相当于在百度图片里搜索一样
        print('开始搜索关键字:{}'.format(keyword))
        page_begin= 0
        page_number= 100
        image_number= 30
        all_pic_urls = []
        while 1:
            if page_begin>image_number:
                break
            print("第{}次请求数据".format(page_begin))
            url=getPage(keyword,page_begin,page_number)
            onepage_urls= get_onepage_urls(url)
            page_begin += 1
     
            all_pic_urls.extend(onepage_urls)
        print('search images: {}'.format(len(list(set(all_pic_urls)))))
        down_pic(list(set(all_pic_urls)), 'C:\photo')
